app/controllers/walks_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "walks".* FROM "walks" WHERE "walks"."user_id" = $1  [["user_id", 1]]
---
  def rankings
    @users = User.all.sort_by{|u| - u.duration_walks_current_month}

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "walks".* FROM "walks" WHERE "walks"."user_id" = $1 ORDER BY created_at desc  [["user_id", 1]]
---
  def index
    @user_selected = User.find_by_id(params[:user_id])
    @walks = @user_selected.walks unless @user_selected.blank?

INSERT INTO "walks" ("user_id", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["duration", 20], ["created_at", "2018-11-18 15:58:56.356811"], ["updated_at", "2018-11-18 15:58:56.356811"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @walk = @user.walks.create(walks_params)
    if @walk.save
      @walk.add_weather_bonus
      unless params[:user_ids].blank?
        params[:user_ids].each do |user_id|
          _walk = User.find(user_id).walks.create(walks_params)

SELECT  "walks".* FROM "walks" WHERE "walks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "walks" WHERE "walks"."id" = $1  [["id", 3]]
---
  def destroy
    @walk = Walk.find_by_id(params[:id])
    @walk.destroy